[
  {
    "id": 1,
    "name": "Pizza Dough",
    "img": "https://www.simplyrecipes.com/thmb/GfYM00BSuQ_yW76h4Dq55RP4p0o=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Homemade-Pizza-Dough-Lead-Shot-2d-ee202758ce084fc4a88917816df9fc07.jpg",
    "video": "https://www.youtube.com/watch?v=sv3TXMSv6Lw&pp=ygUsV2F0Y2ggSG93IHRvIE1ha2UgSG9tZW1hZGUgUGl6emEgUGl6emEgRG91Z2g%3D",
    "category": 1,
    "rate": 4.8,
    "order": 2300,
    "price": 20000,
    "user_id": 7,
    "cook": "15 mins",
    "level": "Mid",
    "prep": "32 mins",
    "description": "Make perfect pizza at home with this classic homemade pizza recipe, including a pizza dough recipe, topping suggestions, and step-by-step instructions with photos.\nWhat to do when your 8-year old nephew comes to visit? Make pizza, of course!\n\nWell, not of course, actually. I didn't think of it until we exhausted Sorry, Monopoly, and gin rummy. But it did turn out to be a brilliant idea as my father had just received a baking stone for Christmas, and my nephew loves pizza.\n\nI told him if he helped me make it I would talk about him on my website and he would be famous. That seemed to get his attention. He thought the dough was \"slimy and gross\" but he loved picking his own toppings, and the finished product was \"awesome\".\ns It Better To Let the Dough Rise Overnight?\nYou don’t have to let your pizza dough rise overnight – or up to 48 hours – in the refrigerator, but if you do, it will develop more flavor and air bubbles that will puff up when the pizza is cooked. (Some people fight over the slices with air bubbles.) Make sure to take the dough out of the refrigerator an hour before using it to bring it to room temperature.\nPizzas With Raw Ingredients\nThere are some toppings that should be cooked first before topping a pizza because they won’t cook fully before the pizza is done cooking. Raw meat should be fully cooked before adding it as a topping. Any vegetables that you don’t want to be raw on the cooked pizza such as onions, peppers, broccoli, or mushrooms should be sautéed first.\n\nMake-Ahead and Freezing Instructions\nAfter the pizza dough has risen, you can freeze it to use later. Divide the dough in half (or the portion sizes you will be using to make your pizzas). Place on parchment paper or a lightly floured dish and place, uncovered, in the freezer for 15 to 20 minutes. Remove from the freezer and place in individual freezer bags, removing as much air as you can from the bags. Return to the freezer and store for up to 3 months.\n\nThaw the pizza dough in the refrigerator overnight or for 5 to 6 hours. Then let the dough sit at room temperature for 30 minutes before stretching it out in the next steps.\nThrow a Pizza Party!"
  },
  {
    "id": 2,
    "name": "The Real Mojito",
    "img": "https://www.allrecipes.com/thmb/c8vpYgeTFfQTdCrerSYdayou-Zk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/147363-TheRealMojito_115-27b592728dd041e7b695df548376685a.jpg",
    "video": "https://www.youtube.com/watch?v=sIvYdLHwv8A&pp=ygUNbW9qaXRvIHJlY2lwZQ%3D%3D",
    "category": 1,
    "rate": 4.9,
    "order": 2300,
    "price": 12000,
    "user_id": 2,
    "cook": "0 mins",
    "level": "Easy",
    "prep": "10 mins",
    "description": "What Is a Mojito?\nA mojito is a classic highball drink that originated in Cuba. Not surprisingly, this cocktail uses ingredients indigenous to Cuba, including rum, lime, mint, and sugar. The mixture is topped off with a little club soda to create a thirst-quenching libation. It requires a bit more labor than many mixed drinks, as it involves first muddling fresh mint, lime, and sugar together to release the flavors. But it's well worth it for a refreshing, fizzy, and mildly sweet rum cocktail that remains one of the most popular to this day.\nThis is an authentic recipe for mojito. I sized the recipe for one serving, but you can adjust it accordingly and make a pitcher full. It's a very refreshing drink for hot summer days. Be careful when drinking it, however. If you make a pitcher you might be tempted to drink the whole thing yourself, and you just might find yourself talking Spanish in no time!\nMojito Ingredients\nRum\nAlways use white rum for mojitos. Avoid spiced rums, because these will take away from the freshness of the mint and lime.\n\nMint\nSpearmint is most commonly used for mojitos and is what you'll likely find at the grocery store labeled generically as \"mint.\" For an authentic Cuban mojito, use mojito mint, or Mentha x villosa, a type of mint native to Cuba with a more understated flavor than that of spearmint.\n\nLime\nUse freshly squeezed limes for best flavor. When shopping for limes, look for fruits with smooth skin, as this indicates the fruit is full of juice.\n\nSugar\nFolks often substitute simple syrup for sugar in mojitos because it blends into the drink more smoothly. However, classic mojito recipes call for granulated sugar. Not only does this ensure the drink isn't overly sweet, but the occasional undissolved sugar granule adds texture that's signature to a classic mojito. If you prefer, you can use superfine/caster sugar in place of granulated sugar, as this will dissolve more easily into cold liquid.\n\nClub Soda\nTop everything off with club soda to lighten up the drink and balance out the other ingredients.\n\nWhat You'll Need to Make a Mojito\nAs with most cocktails, crafting mojitos requires a few special tools — namely, a muddler. This bartending tool is used to crush fresh herbs and fruits to help release their flavors. If you don't have a muddler, use the end of a wooden spoon instead."
  },
  {
    "id": 3,
    "name": "Simple White Cake",
    "img": "https://www.allrecipes.com/thmb/59OSrdhzFypyNdLt3b-vw-MqSPY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/17481-simple-white-cake-DDMFS-4x3-89bf9ff32d0c40179a3d752d4d25f22a.jpg",
    "video": "https://www.youtube.com/watch?v=EYXQmbZNhy8&pp=ygUYc2ltcGxlIHdoaXRlIGNha2UgcmVjaXBl",
    "category": 1,
    "rate": 4.8,
    "order": 2300,
    "price": 20000,
    "user_id": 7,
    "cook": "30 mins",
    "level": "Easy",
    "prep": "10 mins",
    "description": "This simple cake recipe was sent home from our children's school. It is the easiest, best-tasting cake I've ever made. It's great to make with the kids, especially for cupcakes. Use your favorite frosting on top of this delicious cake.\nGather all ingredients.\nPreheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square cake pan.\nCream sugar and butter together in a mixing bowl. Add eggs, one at a time, beating briefly after each addition. Mix in vanilla.\nPour batter into the prepared cake pan.\nBake in the preheated oven until the top springs back when lightly touched, 30 to 40 minutes.\nRemove from the oven and cool completely.\nEnjoy! \n\nA 10-inch round pan will produce similar results. To make cupcakes, line a 12-cup muffin tin with paper liners. Divide batter evenly among the prepared muffin cups, and bake in the preheated oven for 20 to 25 minutes."
  },
  {
    "id": 4,
    "name": "Pizza Margherita",
    "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-51643_11-2f4a2cc.jpg?quality=90&webp=true&resize=300,272",
    "video": "https://www.youtube.com/watch?v=7toSikYGFNM&pp=ygUQUGl6emEgTWFyZ2hlcml0YQ%3D%3D",
    "category": 1,
    "rate": 4.5,
    "order": 2300,
    "price": 20000,
    "user_id": 2,
    "cook": "10 mins",
    "level": "Easy",
    "prep": "25 mins",
    "description": "Method\nSTEP 1\nMake the base: Put the flour into a large bowl, then stir in the yeast and salt. Make a well, pour in 200ml warm water and the olive oil and bring together with a wooden spoon until you have a soft, fairly wet dough. Turn onto a lightly floured surface and knead for 5 mins until smooth. Cover with a tea towel and set aside. You can leave the dough to rise if you like, but it’s not essential for a thin crust.\n\nSTEP 2\nMake the sauce: Mix the passata, basil and crushed garlic together, then season to taste. Leave to stand at room temperature while you get on with shaping the base.\n\nSTEP 3\nRoll out the dough: if you’ve let the dough rise, give it a quick knead, then split into two balls. On a floured surface, roll out the dough into large rounds, about 25cm across, using a rolling pin. The dough needs to be very thin as it will rise in the oven. Lift the rounds onto two floured baking sheets.\n\nSTEP 4\nTop and bake: heat the oven to 240C/220C fan/gas 8. Put another baking sheet or an upturned baking tray in the oven on the top shelf. Smooth sauce over bases with the back of a spoon. Scatter with cheese and tomatoes, drizzle with olive oil and season. Put one pizza, still on its baking sheet, on top of the preheated sheet or tray. Bake for 8-10 mins until crisp. Serve with a little more olive oil, and basil leaves if using. Repeat step for remaining pizza."
  },
  {
    "id": 5,
    "name": "Hamburger Patty Recipe",
    "img": "https://i0.wp.com/www.aspicyperspective.com/wp-content/uploads/2020/05/Best-Hamburger-Patty-Recipe-14.jpg?resize=650%2C882&ssl=1",
    "video": "https://www.youtube.com/watch?v=EYXQmbZNhy8&pp=ygUYc2ltcGxlIHdoaXRlIGNha2UgcmVjaXBl",
    "category": 1,
    "rate": 4.3,
    "order": 2300,
    "price": 20000,
    "user_id": 7,
    "cook": "30 mins",
    "prep": "10 mins",
    "description":"Best Hamburger Patty Recipe – Thick or thin, made on the grill or stovetop, this is the best and easiest all-purpose recipe for perfect hamburger patties every time! These juicy, delicious homemade hamburgers are ready in less than 30 minutes and are a must-make for your next cookout."
  },
  {
    "id": 6,
    "name": "Pizza Margherita",
    "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-51643_11-2f4a2cc.jpg?quality=90&webp=true&resize=300,272",
    "video": "https://www.youtube.com/watch?v=7toSikYGFNM&pp=ygUQUGl6emEgTWFyZ2hlcml0YQ%3D%3D",
    "category": 1,
    "rate": 4.4,
    "order": 2300,
    "price": 20000,
    "user_id": 2,
    "cook": "10 mins",
    "level": "Easy",
    "prep": "25 mins",
    "description": "Method\nSTEP 1\nMake the base: Put the flour into a large bowl, then stir in the yeast and salt. Make a well, pour in 200ml warm water and the olive oil and bring together with a wooden spoon until you have a soft, fairly wet dough. Turn onto a lightly floured surface and knead for 5 mins until smooth. Cover with a tea towel and set aside. You can leave the dough to rise if you like, but it’s not essential for a thin crust.\n\nSTEP 2\nMake the sauce: Mix the passata, basil and crushed garlic together, then season to taste. Leave to stand at room temperature while you get on with shaping the base.\n\nSTEP 3\nRoll out the dough: if you’ve let the dough rise, give it a quick knead, then split into two balls. On a floured surface, roll out the dough into large rounds, about 25cm across, using a rolling pin. The dough needs to be very thin as it will rise in the oven. Lift the rounds onto two floured baking sheets.\n\nSTEP 4\nTop and bake: heat the oven to 240C/220C fan/gas 8. Put another baking sheet or an upturned baking tray in the oven on the top shelf. Smooth sauce over bases with the back of a spoon. Scatter with cheese and tomatoes, drizzle with olive oil and season. Put one pizza, still on its baking sheet, on top of the preheated sheet or tray. Bake for 8-10 mins until crisp. Serve with a little more olive oil, and basil leaves if using. Repeat step for remaining pizza."
  }
]